# Дана задача:Написать программу, которая из имеющегося массива строк формирует массив из строк, длина которых меньше либо равно 3 символа. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами
Пример программы на языке Python, которая выполняет данную задачу:

# Ввод массива строк с клавиатуры
arr = input("Введите массив строк, разделенных пробелами: ").split()

# Создание нового массива строк длиной не более 3 символов
new_arr = []
for s in arr:
    if len(s) <= 3:
        new_arr.append(s)

# Вывод нового массива строк
print("Массив строк длиной не более 3 символов:")
print(new_arr)

# В этой программе мы используем функцию input() для ввода массива строк с клавиатуры. Затем мы используем метод split() для разделения введенных строк на отдельные элементы массива. Мы создаем новый пустой массив new_arr и используем цикл for для прохода по всем элементам введенного массива arr. Если длина текущей строки s не превышает 3 символа, мы добавляем ее в новый массив new_arr с помощью метода append(). Наконец, мы выводим новый массив строк на экран с помощью функции print().

Добавляю блок-схему:
+---------------------------+
| ВВОД МАССИВА СТРОК         |
|                           |
|          +--------+       |
| Ввод --->|  arr   |       |
|          +--------+       |
+---------------------------+
                   |
                   v
+---------------------------+
| СОЗДАНИЕ НОВОГО МАССИВА   |
|                           |
|          +--------+       |
|          | new_arr|       |
|          +--------+       |
+---------------------------+
                   |
                   v
+---------------------------+
| ПРОХОЖДЕНИЕ ПО ЭЛЕМЕНТАМ  |
| ИСХОДНОГО МАССИВА        |
|                           |
|         +-------+         |
| for s in|  arr  |         |
|         +-------+         |
+---------------------------+
                   |
                   v
+---------------------------+
| ПРОВЕРКА ДЛИНЫ СТРОКИ     |
|                           |
|           +-----+         |
| if len(s) | <= 3|         |
|           +-----+         |
+---------------------------+
                   |
                   v
+---------------------------+
| ДОБАВЛЕНИЕ СТРОКИ В НОВЫЙ |
| МАССИВ                     |
|                           |
|          +--------+       |
|   append | new_arr| <-----+
|          +--------+       |
+---------------------------+
                   |
                   v
+---------------------------+
| ВЫВОД НОВОГО МАССИВА      |
|                           |
|          +--------+       |
|  print   | new_arr|       |
|          +--------+       |
+---------------------------+
