# Дана задача:Написать программу, которая из имеющегося массива строк формирует массив из строк, длина которых меньше либо равно 3 символа. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами
вот пример программы на языке C#, которая выполняет заданную задачу:
using System;

class Program
{
    static void Main(string[] args)
    {
        // Ввод массива строк с клавиатуры
        Console.WriteLine("Введите массив строк, разделенных пробелами:");
        string[] arr = Console.ReadLine().Split();

        // Создание нового массива строк длиной не более 3 символов
        string[] new_arr = new string[0];
        foreach (string s in arr)
        {
            if (s.Length <= 3)
            {
                Array.Resize(ref new_arr, new_arr.Length + 1);
                new_arr[new_arr.Length - 1] = s;
            }
        }

        // Вывод нового массива строк
        Console.WriteLine("Массив строк длиной не более 3 символов:");
        foreach (string s in new_arr)
        {
            Console.WriteLine(s);
        }
    }
}

В этой программе мы используем класс Console для ввода и вывода данных. Мы используем метод ReadLine() для ввода массива строк с клавиатуры и метод Split() для разделения введенных строк на отдельные элементы массива. Мы создаем новый пустой массив new_arr с помощью ключевого слова new и используем цикл foreach для прохода по всем элементам введенного массива arr. Если длина текущей строки s не превышает 3 символа, мы изменяем размер нового массива с помощью метода Array.Resize() и добавляем в него текущую строку. Наконец, мы выводим новый массив строк на экран с помощью метода WriteLine().

Добавляю блок-схему:
+---------------------------+
| ВВОД МАССИВА СТРОК         |
|                           |
|          +--------+       |
| Ввод --->|  arr   |       |
|          +--------+       |
+---------------------------+
                   |
                   v
+---------------------------+
| СОЗДАНИЕ НОВОГО МАССИВА   |
|                           |
|          +--------+       |
|          | new_arr|       |
|          +--------+       |
+---------------------------+
                   |
                   v
+---------------------------+
| ПРОХОЖДЕНИЕ ПО ЭЛЕМЕНТАМ  |
| ИСХОДНОГО МАССИВА        |
|                           |
|         +-------+         |
| for s in|  arr  |         |
|         +-------+         |
+---------------------------+
                   |
                   v
+---------------------------+
| ПРОВЕРКА ДЛИНЫ СТРОКИ     |
|                           |
|           +-----+         |
| if len(s) | <= 3|         |
|           +-----+         |
+---------------------------+
                   |
                   v
+---------------------------+
| ДОБАВЛЕНИЕ СТРОКИ В НОВЫЙ |
| МАССИВ                     |
|                           |
|          +--------+       |
|   append | new_arr| <-----+
|          +--------+       |
+---------------------------+
                   |
                   v
+---------------------------+
| ВЫВОД НОВОГО МАССИВА      |
|                           |
|          +--------+       |
|  print   | new_arr|       |
|          +--------+       |
+---------------------------+

На блок-схеме показаны основные шаги алгоритма и связи между ними. Каждый блок представляет собой отдельный этап выполнения алгоритма, а стрелки показывают направление передачи данных между этапами. Входные данные (массив строк) поступают на вход алгоритма и обрабатываются поэтапно. На выходе получается новый массив строк длиной не более 3 символов, который выводится на экран.
